mach1na/folloup/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Waveshare ESP32-S3-ePaper-3.97 (ESP32-S3-WROOM-1-N16R8): 8 MB octal PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=98304

# Internal DRAM is tight on this board -- FreeRTOS task stacks/TCBs are always
# internal-only regardless of SPIRAM settings, and until epaper_panel's two ~96KB
# framebuffers were moved to PSRAM (see epaper_panel.cpp) they alone left too little
# internal DRAM for boot-time task creation and even ESP-IDF's own lazy one-time
# allocations (TLS hardware-crypto lock/interrupt setup) to succeed. Trimming Wi-Fi's
# static RX buffer pool (always allocated at init, default 10) buys back further
# internal-RAM headroom during Wi-Fi AP bring-up.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4

# mbedTLS defaults to allocating every TLS buffer from internal-only RAM with no PSRAM
# fallback (MBEDTLS_INTERNAL_MEM_ALLOC), which fails outright once internal DRAM is
# tight -- observed as ESP_ERR_HTTP_CONNECT / "Dynamic Impl: alloc(...) failed" during
# the TLS handshake even with PSRAM mostly free. DEFAULT_MEM_ALLOC routes through the
# same adaptive allocator as everything else (small allocations stay internal via
# SPIRAM_MALLOC_ALWAYSINTERNAL, larger ones spill to PSRAM). DYNAMIC_BUFFER further
# allocates TLS TX/RX buffers on demand and frees them after use instead of holding
# ~20KB reserved for a connection's whole lifetime.
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

# Waveshare board: 16 MB QIO flash.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# OTA-ready custom flash layout (16 MB).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Audio: ES8311 codec over the esp_codec_dev / esp_audio_codec managed components.
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=n

# USB mass storage (OTG) exposes the SD card, per the board's USB-OTG storage mode.
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

# Auto-sleep demo defaults for hardware validation.
CONFIG_FOLLOWUP_AUTO_SLEEP_DISPLAY_SLEEP_TIMEOUT_SECONDS=180
CONFIG_FOLLOWUP_AUTO_SLEEP_LIGHT_SLEEP_TIMEOUT_SECONDS=1800

# Wi-Fi and clock-sync demo defaults. Runtime NVS settings take precedence over
# these built-in station credentials.
CONFIG_FOLLOWUP_WIFI_AP_PREFIX="Followup"
CONFIG_FOLLOWUP_WIFI_STA_SSID=""
CONFIG_FOLLOWUP_WIFI_STA_PASSWORD=""
CONFIG_FOLLOWUP_WIFI_START_IN_AP_MODE=n
CONFIG_FOLLOWUP_TIME_SYNC_DEFAULT_ENABLED=y
CONFIG_FOLLOWUP_DEFAULT_TIMEZONE_NAME="North_America_Eastern"
CONFIG_FOLLOWUP_GEMINI_API_KEY=""

# SD card (SDMMC) long-filename support.
CONFIG_FATFS_LFN_NONE=n
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_LFN_STACK=n
CONFIG_FATFS_USE_LABEL=y
